// Задание 17: Объявите и вызовите функцию `print`, которая принимает строку
// выводит её на консоль.

#include <iostream>
using namespace std;

int main()
{
    print("bo bo bo");
    return 0;
}

void print(string msg) {
    cout << msg << endl;
}

