// Задание 29: Вызовите функцию `reverse_string`, которая переворачивает строку.

#include <iostream>
using namespace std;

... reverse_string(... str) {
    ... result;
    for (int i = str.length() - 1; i >= 0; i--) {
        result += str[i];
    }
    return return result;
}

int main() {
    cout << ... return 0;
}