// Задание 25: Объявите функцию `factorial`, которая "вычисляет" 
// факториал целого числа.

#include <iostream>
using namespace std;

int main() {
    cout << factorial(5);
    return 0;
}